# EX3: Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/US_Baby_Names_right.csv'``.

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names=pd.read_csv('../../DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names = baby_names.drop(columns=['Unnamed: 0','Id'])
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [5]:
baby_names['Gender'].value_counts(ascending=False)

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
baby_names_grp = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [7]:
print(len(baby_names_grp))

17632

### Step 9. What is the name with most occurrences?

In [8]:
baby_names_agg = baby_names_grp['Count'].agg(np.sum).sort_values(ascending=False)
baby_names_agg

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
             ...
Janira           5
Arsalan          5
Lizvet           5
Janisha          5
Destenie         5
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [9]:
#the minimum values of a name
print(baby_names_agg.min())
#convert to a dataframe
baby_names_agg = pd.DataFrame(baby_names_agg)

print('Number of Least occurrences:  ', len(baby_names_agg['Count'][baby_names_agg['Count']==baby_names_agg['Count'].min()]))

5
Number of Least occurrences:   2578

### Step 11. What is the median name occurrence?

In [10]:
baby_names_agg.median()

Count    49.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [11]:
baby_names_agg.std()

Count    11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
baby_names_grp['Count'].agg([np.mean,np.min,np.max,np.std])

              mean  amin  amax        std
Name
Aaban     6.000000     6     6   0.000000
Aadan     5.750000     5     7   0.957427
Aadarsh   5.000000     5     5        NaN
Aaden    17.479592     5   158  21.154974
Aadhav    6.000000     6     6        NaN
...            ...   ...   ...        ...
Zyra      6.000000     5     8   1.154701
Zyrah     5.500000     5     6   0.707107
Zyren     6.000000     6     6        NaN
Zyria     5.900000     5     7   0.737865
Zyriah    6.444444     5    10   1.666667

[17632 rows x 4 columns]

In [15]:
baby_names_agg.quantile()

Count    49.0
Name: 0.5, dtype: float64

In [17]:
baby_names_agg['Count'].agg([np.mean,np.min,np.max,np.std],)

mean      2008.932169
amin         5.000000
amax    242874.000000
std      11006.069468
Name: Count, dtype: float64